In [96]:
import pandas as pd
import numpy as np

In [172]:
data = pd.read_csv('Salaries.csv')

# Display top 10 rows to the dataset

In [12]:
data.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189083,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492,89062.9,134426,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256577,0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176933,86362.7,40132.2,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262,0,17115.7,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

# Check last 10 rows of the dataset

In [5]:
data.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# Find shape of our dataset(Number of Rows and Number of Columns)

In [8]:
data.shape

(148654, 13)

In [10]:
print("Number of rows",data.shape[0])

Number of rows 148654

In [11]:
print("NUmber of columns",data.shape[1])

NUmber of columns 13

# Getting information about our dataset like total rows,

# Total number of columns, Datatypes of each columns and memory requirement

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

 # Check null Value

In [18]:
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

# Drop ID, Notes, Agency and status columns

In [19]:
data.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [20]:
data = data.drop(['Id', 'Notes', 'Agency', 'Status'],axis = 1 )

In [22]:
data.head(1)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011

# Get overall statistics about the dataframe

In [29]:
data.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

# Find occurrence of the employee names

In [34]:
data['EmployeeName'].value_counts()

Kevin Lee                13
Steven Lee               11
Richard Lee              11
William Wong             11
Michael Wong              9
                         ..
Shawn Zimmerman           1
JENNIFER DELUTA-TALOA     1
Erika  Erazo              1
Dylan Fernandes           1
Pamela Levin              1
Name: EmployeeName, Length: 110811, dtype: int64

# Find the number of unique job title

In [36]:
data['JobTitle'].nunique()

2159

# Total number of jobs titles contain captain

In [46]:
len(data[data['JobTitle'].str.contains('CAPTAIN', case = False)])

552

# Display all the employee names from fire department

In [47]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [51]:
data[data['JobTitle'].str.contains('fire', case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

# Find minimum, maximum and average basepay

In [53]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [110]:
data['BasePay'].describe()

count      1000.000000
mean     145663.998200
std       39019.692748
min       25400.000000
25%      112421.430000
50%      140546.870000
75%      176856.180000
max      294580.020000
Name: BasePay, dtype: float64

# Replace 'Not Provided' in EmployeeName column to NaN

In [101]:
data['EmployeeName'] = data['EmployeeName'].replace('Not provided', np.nan)

# Find job title of ALBERT PARDINI

In [126]:
data[data['EmployeeName'].str.contains('PARDINI')]['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [125]:
data[data['EmployeeName'].str.contains('PARDINI')]['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

# Display name of the person having the highest BasePay

In [129]:
data['BasePay'].max()

294580.02

# Display name of the person having the highest basepay

In [135]:
data[data['BasePay'].max() == data['BasePay']]['EmployeeName']

12    EDWARD HARRINGTON
Name: EmployeeName, dtype: object

# Find Average basePay of all employee per year

In [148]:
data.groupby('Year').mean()['BasePay']

Year
2011    145663.9982
Name: BasePay, dtype: float64

# Find Average basepay of all emplyee per job title

In [168]:
data.groupby('JobTitle').mean()['BasePay']

JobTitle
ADMINISTRATOR, SFGH MEDICAL CENTER                  245124.440000
ANESTHETIST                                         191930.050909
ASSISTANT CHIEF ATTORNEY I                          185047.585238
ASSISTANT CHIEF ATTORNEY II                         193718.000000
ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)    186457.075000
                                                        ...
TRAIN CONTROLLER                                     99965.640000
TRANSIT OPERATIONS SPECIALIST                       104737.355000
TRANSIT SUPERVISOR                                   88563.295714
WIRE ROPE CABLE MAINTENANCE MECHANIC                 77916.000000
WIRE ROPE CABLE MAINTENANCE SUPERVISOR               85624.870000
Name: BasePay, Length: 113, dtype: float64

# Find average basepay of employee having job title MANAGER

In [179]:
data[data['JobTitle'].str.contains('MANAGER')]

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,0,0,0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
83,83,83,83,83,83,84,EDWARD REISKIN,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,230827.12,0.0,0.00,NaN,230827.12,230827.12,2011,NaN,San Francisco,NaN
87,87,87,87,87,87,88,KEVIN BARRY,MANAGER VII,96814.36,0.0,133563.47,NaN,230377.83,230377.83,2011,NaN,San Francisco,NaN
95,95,95,95,95,95,96,MIVIC HIROSE,MANAGER VIII,215180.76,0.0,12000.00,NaN,227180.76,227180.76,2011,NaN,San Francisco,NaN
162,162,162,162,162,162,163,JULIE LABONTE,MANAGER VIII,207501.20,0.0,2903.37,NaN,210404.57,210404.57,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
916,916,916,916,916,916,917,GORDON HOY,MANAGER VIII,171065.59,0.0,1192.56,NaN,172258.15,172258.15,2011,NaN,San Francisco,NaN
947,947,947,947,947,947,948,DOROTHY QUAN,NURSE MANAGER,154939.50,0.0,16403.96,NaN,171343.46,171343.46,2011,NaN,San Francisco,NaN
957,957,957,957,957,957,958,ELIZABETH POTTER,MANAGER V,160812.19,0.0,10088.57,NaN,170900.76,170900.76,2011,NaN,San Francisco,NaN
979,979,979,979,979,979,980,EUGENE CLENDINEN,MANAGER VIII,161479.27,0.0,8750.10,NaN,170229.37,170229.37,2011,NaN,San Francisco,NaN
993,993,993,993,993,993,994,GRACE SALUD,NURSE MANAGER,156312.00,0.0,13587.12,NaN,169899.12,169899.12,2011,NaN,San Francisco,NaN

# Find top 5 most common jobs

In [183]:
data['JobTitle'].value_counts().head()

FIREFIGHTER                           133
LIEUTENANT, FIRE DEPARTMENT            62
FIRE FIGHTER PARAMEDIC                 43
CAPTAIN, FIRE SUPPRESSION              42
BATTALION CHIEF, (FIRE DEPARTMENT)     41
Name: JobTitle, dtype: int64